Repository: pingfangx/TranslatorX-other
Catalog: AndroidDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Display progress bars to a user in a non-interruptive way.
zh_cn: 以非中断方式向用户显示进度条。

source: Display the 'home' element such that it appears as an 'up' affordance.
zh_cn: 显示 'home' 元素，使其显示为 'up' 功能。

source: Displaying a blank starting window for the app immediately after launch.
zh_cn: 启动后立即显示应用程序的空白启动窗口。

source: Displays TV contents.
zh_cn: 显示电视内容。

source: Displays a button with an image (instead of text) that can be pressed or clicked by the user.
zh_cn: 显示一个按钮，其中包含可由用户按下或单击的图像(而不是文本)。

source: Displays a list of tab labels representing each page in the parent's tab collection.
zh_cn: 显示代表父级选项卡集合中每一页的选项卡标签列表。

source: Displays a vertically-scrollable collection of views, where each view is positioned immediatelybelow the previous view in the list.
zh_cn: 显示可垂直滚动的 view 集合，其中每个 view 紧邻列表中的上一个 view。

source: Displays a video file.
zh_cn: 显示视频文件。

source: Displays checked/unchecked states as a button with a "light" indicator and by default accompanied with the text "ON" or "OFF".
zh_cn: 将已选中/未选中状态显示为带有“亮”指示的按钮，默认情况下伴随文本“ON”或“OFF”。

source: Displays image resources, for example Bitmap or Drawable resources.
zh_cn: 显示图像资源，例如 Bitmap 或 Drawable 资源。

source: Do not do this.
zh_cn: 千万不要这样做。

source: Do not use AnimationDrawable to create frame-by-frame animations because doing so requires that you include a separate bitmap file for each frame of the animation, which drastically increase the size of your APK.
zh_cn: 不要使用 AnimationDrawable 来创建逐帧动画，因为这样做需要为动画的每个帧包含一个单独的位图文件，这会大大增加动画的大小你的 APK。

source: Do not use the android:background attribute or call BottomAppBar.setBackground because the BottomAppBar manages its background internally.
zh_cn: 不要使用 android:background 属性或调用 BottomAppBar.setBackground，因为 BottomAppBar 在内部管理其背景。

source: Do not use the android:background attribute.
zh_cn: 不要使用 android:background 属性。

source: Docs
zh_cn: 文档

source: Documentation
zh_cn: 文档

source: Does a dry run, finds the ViewHolder but does not remove
zh_cn: 进行预演，找到 ViewHolder 但不移除

source: Does not do anything to hide gaps.
zh_cn: 不做任何操作来隐藏间隙。

source: Doing so can hide a slow activity launch.
zh_cn: 这样做可以隐藏缓慢的activity启动。

source: Doing so can improve the performance of warm and hot starts, as well.
zh_cn: 这样做也可以改善温启动和热启动的性能。

source: Doing so results in an image of equal quality but a smaller memory footprint.
zh_cn: 这样做会产生质量相同但内存占用更少的图像。

source: Doing so results in poor user interface performance and a poor user experience.
zh_cn: 这样做会导致用户界面性能下降和用户体验不佳。

source: Don't Catch Generic Exception
zh_cn: 请勿捕获常规异常

source: Don't Ignore Exceptions
zh_cn: 请勿忽略异常

source: Don't Use Finalizers
zh_cn: 请勿使用终结器

source: Don't apply if the widget is part of an horizontal chain.
zh_cn: 如果部件是水平链的一部分，则不适用。

source: Don't apply if the widget is part of an vertical chain.
zh_cn: 如果部件是垂直链的一部分，则不适用。

source: Drag the dotted line to reposition it and click the circle at the edge of the guideline to toggle the measurement mode.
zh_cn: 拖动虚线来重新定位它，并单击参考线边缘处的圆圈来切换测量模式。

source: Draw any appropriate decorations into the Canvas supplied to the RecyclerView.
zh_cn: 在提供给 RecyclerView 的画布上，画出任何适当的 decorations。

source: Draw bitmaps using drawBitmap().
zh_cn: 使用 drawBitmap() 绘制位图。

source: Draw more complex shapes using the Path class.
zh_cn: 使用 Path 类绘制更复杂的形状。

source: Draw one child of this View Group.
zh_cn: 绘制该 View Group 的一个子 view。

source: Draw primitive shapes using drawRect(), drawOval(), and drawArc().
zh_cn: 使用 drawRect()，drawOval() 和 drawArc() 绘制基本形状。

source: Draw text using drawText().
zh_cn: 使用 drawText() 绘制文本。

source: Draw your application for the first time.
zh_cn: 首次绘制你的应用程序。

source: Drawable for displaying the image.
zh_cn: 用于显示图像的 Drawable。

source: Drawable for the vertical bar shown at the beginning and at the end of the selected date.
zh_cn: drawable 用于所选日期开头和结尾处显示的垂直条。

source: Drawable or color that is used as a divider for children.
zh_cn: drawable 或颜色，用作子项的分隔线。

source: Drawable or color to draw between list items.
zh_cn: 列表项之间绘制的 drawable 或颜色。

source: Drawable to be drawn over the view to mark it as autofilled
zh_cn: drawable 在 view 上绘制以将其标记为自动填充

source: Drawable to set as the logo that appears at the starting side of the Toolbar, just after the navigation button.
zh_cn: drawable 以设置为出现在工具栏起始侧的徽标，位于导航按钮之后。

source: Drawable to use as a vertical divider between buttons.
zh_cn: 用作按钮之间的垂直分隔线的 drawable。

source: Drawable to use as the "thumb" that switches back and forth.
zh_cn: 可绘制用作来回切换的“thumb”。

source: Drawable to use as the "track" that the switch thumb slides within.
zh_cn: 可绘制用作开关 thumb 滑动的“轨道”。

source: Drawable used for the button graphic (for example, checkbox and radio button).
zh_cn: Drawable 用于按钮图形(例如，复选框和单选按钮)。

source: Drawable used for the check mark graphic.
zh_cn: Drawable 用于复选标记图形。

source: Drawable used for the indeterminate mode.
zh_cn: Drawable 用于不确定模式。

source: Drawable used for the progress mode.
zh_cn: Drawable 用于进度模式。

source: Drawable used to draw the divider between tabs.
zh_cn: Drawable 用于在选项卡之间绘制分隔符。

source: Drawable used to draw the left part of the strip underneath the tabs.
zh_cn: Drawable 用于在标签下方绘制条带的左侧部分。

source: Drawable used to draw the right part of the strip underneath the tabs.
zh_cn: Drawable 用于在标签下方绘制条带的右侧部分。

source: Drawable used to indicate the currently selected item in the list.
zh_cn: Drawable 用于指示列表中当前选定的项目。

source: Drawer positioning and layout is controlled using the android:layout_gravity attribute on child views corresponding to which side of the view you want the drawer to emerge from: left or right (or start/end on platform versions that support layout direction.) Note that you can only have one drawer view for each vertical edge of the window.
zh_cn: 使用子 view 上的 android:layout_gravity 属性控制抽屉定位和布局，该属性对应于你希望抽屉出现的 view 的哪一侧：左侧或右侧（或支持的平台版本上的开始/结束布局方向。）请注意，窗口的每个垂直边缘只能有一个抽屉 view。

source: DrawerLayout acts as a top-level container for window content that allows for interactive "drawer" views to be pulled out from one or both vertical edges of the window.
zh_cn: DrawerLayout 充当窗口内容的顶级容器，允许从窗口的一个或两个垂直边缘拉出交互式“抽屉”view。

source: Drawers commonly use match_parent for height with a fixed width.
zh_cn: 抽屉通常使用 match_parent 作为高度并具有固定宽度。

source: Drawing
zh_cn: 绘制

source: Drawing a UI is only one part of creating a custom view.
zh_cn: 绘制 UI 只是创建自定义 view 的一部分。

source: Drawing is handled by walking the tree and recording the drawing commands of any View that needs to update.
zh_cn: 绘制操作，先遍厉一遍 view 树，记录需要更新的 view 的绘制命令。

source: Draws remaining destination pixels over source pixels.
zh_cn: 剩余的目标像素绘制在源像素上。

source: Draws remaining source pixels over destination pixels.
zh_cn: 剩余的源像素绘制在目标像素上。

source: Draws remaining source pixels.
zh_cn: 绘制剩余的源像素。

source: Draws the thumb on a seekbar.
zh_cn: 在 seekbar 上绘制 thumb。

source: Due to expensive nature of rounded corner clipping, on platforms before Lollipop, CardView does not clip its children that intersect with rounded corners.
zh_cn: 由于圆角切割的昂贵性质，在 Lollipop 之前的平台上，CardView 不会剪切与圆角相交的子项。

source: Dump it from the cache.
zh_cn: 从缓存中转储它。

source: Duration of the indeterminate animation.
zh_cn: 不确定动画的持续时间。

source: Duration, in milliseconds, of the fade out effect after the user is done drawing a gesture.
zh_cn: 用户完成绘制手势后的淡出效果的持续时间(以毫秒为单位)。

source: During layout, GridLayout solves the constraints so as to return the unique solution to those constraints for which all variables are less-than-or-equal-to the corresponding value in any other valid solution.
zh_cn: 在布局期间，GridLayout 处理约束，以便将唯一解决方案返回到那些约束，其中所有变量都小于或等于任何其他有效解决方案中的相应值。

source: During the build process, first ProGuard removes unused code but leaves unused resources.
zh_cn: 在构建过程中，首先 ProGuard 移除未使用的代码但保留未使用的资源。

source: During this pass each parent is responsible for positioning all of its children using the sizes computed in the measure pass.
zh_cn: 在这个过程中，每个父 view 负责它所有的子 view 的定位，它使用测量过程的尺寸结果。

source: E.g., a blue image by default, an orange one for when focused, and a yellow one for when pressed.
zh_cn: 例如，默认为蓝色图像，聚焦时为橙色图像，按下时为黄色图像。

source: END aligns the result to the right and bottom edges of dst.
zh_cn: END 将结果与 dst 的右边和底边对齐。

source: EXACTLY: This is used by the parent to impose an exact size on the child.
zh_cn: EXACTLY：用于父 view 强加给子 view 一个确切的尺寸。

source: Each View.setHasTransientState(true) call must be matched by a View.setHasTransientState(false) call, otherwise, the state of the View may become inconsistent.
zh_cn: 每个 View.setHasTransientState(true) 调用都必须与 View.setHasTransientState(false) 调用匹配，否则，View 的状态可能会变得不一致。

source: Each approach allows you to specify how diffs should be computed based on item data.
zh_cn: 每种方法都允许你指定应如何根据项目数据计算差异。

source: Each call to this method returns a new instance of a Context object; Context objects are not shared, however common state (ClassLoader, other Resources for the same configuration) may be so the Context itself can be fairly lightweight.
zh_cn: 每次调用此方法都会返回 Context 对象的新实例；上下文对象不是共享的，但是常见的状态(ClassLoader，相同配置的其他资源)可能因此 Context 本身可以相当轻量级。

source: Each channel (RGB and alpha for translucency) is stored with 8 bits of precision (256 possible values.) This configuration is very flexible and offers the best quality.
zh_cn: 每个通道(用于半透明的 RGB 和 alpha)都以 8 位精度(256 个可能值)进行存储。此配置非常灵活，可提供最佳质量。

source: Each component ranges between 0..255 with 0 meaning no contribution for that component, and 255 meaning 100% contribution.
zh_cn: 每个组件的范围在 0..255 之间，0 表示对该组件没有贡献，255 表示 100％贡献。

source: Each constraint defines the view's position along either the vertical or horizontal axis; so each view must have a minimum of one constraint for each axis, but often more are necessary.
zh_cn: 每一个约束都定义了 View 在水平或垂直方向的位置：因此每一个 View 与轴线（垂直和水平方向）都至少应该有一个约束。

source: Each constraint handle can be used for just one constraint, but you can create multiple constraints (from different views) to the same anchor point.
zh_cn: 每个约束句柄只能用于一个约束，但你可以创建多个约束(从不同的 view)到同一个定位点。

source: Each constraint represents a connection or alignment to another view, the parent layout, or an invisible guideline.
zh_cn: 每一个约束表示到另一个 view，父布局，或者不可见的参考线的连接或者对齐。

source: Each decor view's position can be controlled via its android:layout_gravity attribute.
zh_cn: 每个装饰 view 的位置都可以通过其 android:layout_gravity 属性进行控制。

source: Each field of outRect specifies the number of pixels that the item view should be inset by, similar to padding or margin.
zh_cn: outRect 的每一个字段指定了 item view 应该内凹的像素值，类似于 padding 或 margin。

source: Each line of text in your code should be at most 100 characters long.
zh_cn: 你的代码中每一行文本的长度都应该不超过 100 个字符。

source: Each menu item title, icon and enabled state will be used for displaying bottom navigation bar items.
zh_cn: 每个菜单项标题，图标和启用状态将用于显示底部导航栏项。

source: Each of the margins so defined may be independently overridden by an assignment to the appropriate layout parameter.
zh_cn: 如此定义的每个边距可以通过对适当布局参数的赋值独立地覆盖。

source: Each of these methods returns a boolean indicating success or failure.
zh_cn: 每个方法都返回一个表示成功或失败的布尔值。

source: Each parent up the view hierarchy will be given an opportunity to respond and claim the nested scrolling operation by returning true.
zh_cn: view 层次结构中的每个父级都将有机会通过返回 true 来响应并声明嵌套滚动操作。

source: Each pixel is stored as a single translucency (alpha) channel.
zh_cn: 每个像素都存储为单个半透明(alpha)通道。

source: Each pixel is stored on 2 bytes and only the RGB channels are encoded: red is stored with 5 bits of precision (32 possible values), green is stored with 6 bits of precision (64 possible values) and blue is stored with 5 bits of precision.
zh_cn: 每个像素存储在 2 个字节上，并且只有 RGB 通道被编码：红色以 5 位精度(32 个可能值)存储，绿色以 6 位精度(64 个可能值)存储，蓝色以 5 位精度。

source: Each pixel is stored on 2 bytes.
zh_cn: 每个像素都存储在 2 个字节中。

source: Each pixel is stored on 4 bytes.
zh_cn: 每个像素存储在 4 个字节中。

source: Each row has zero or more cells; each cell can hold one View object.
zh_cn: 每行有零个或多个单元格；每个单元格可以容纳一个 View 对象。

source: Each spec defines the set of rows or columns that are to be occupied; and how children should be aligned within the resulting group of cells.
zh_cn: 每个规格定义了要占用的行或列集；以及子项应该如何在最终的单元格组中对齐。

source: Each variable should be declared in the innermost block that encloses all uses of the variable.
zh_cn: 每个变量应该在包含变量所有使用场合的最内层的块中进行声明。

source: Each view pushes dimension specifications down the tree during the recursion.
zh_cn: 在递归期间，每个 view 都会在树中向下推送尺寸规格。

source: Either way, you want something that the built-in components just won't do, no matter how you combine them.
zh_cn: 不管怎样，你的需求预制的组伯是无法完成的，不管你怎么组合它们。

source: Enable hiding the action bar on content scroll.
zh_cn: 启用隐藏内容滚动上的操作栏。

source: Enable or disable layout and scroll.
zh_cn: 启用或禁用布局和滚动。

source: Enable or disable nested scrolling for this view.
zh_cn: 启用或禁用该 view 的嵌套滚动。

source: Enable or disable the "home" button in the corner of the action bar.
zh_cn: 启用或禁用操作栏一角的“主页”按钮。

source: Enables the fast scroll thumb that can be dragged to quickly scroll through the list.
zh_cn: 启用可以拖动的快速滚动滑块以快速滚动列表。

source: Ends all animations on the view created by the RecyclerView.ItemAnimator.
zh_cn: 结束 view 的所有动画，这些动画由 RecyclerView.ItemAnimator 创建。

source: Enter a name for the layout file and enter "android.support.constraint.ConstraintLayout" for the Root Tag.
zh_cn: 输入一个布局文件的名字，然后输入 "android.support.constraint.ConstraintLayout" 作为 Root Tag。

source: Enum for the ways a path may be filled.
zh_cn: 填充路径的方式的枚举。

source: Enum values
zh_cn: 枚举值

source: Equivalent to calling notifyItemChanged(position, null);.
zh_cn: 相当于调用 notifyItemChanged(position, null);。

source: Equivalent to calling notifyItemRangeChanged(position, itemCount, null);.
zh_cn: 相当于调用 notifyItemRangeChanged(position, itemCount, null);。

source: Even if only one app uses your view, that app needs to handle different screen sizes, multiple screen densities, and various aspect ratios in both portrait and landscape mode.
zh_cn: 即使只有一个应用程序使用你的 view，该应用程序也需要在纵向和横向模式下处理不同的屏幕尺寸，多个屏幕密度和各种宽高比。

source: Even if sharing is allowed, the implementation may still decide to make a deep copy of the input data.
zh_cn: 即使允许共享，实现仍可能决定对输入数据进行深层复制。

source: Even though a view can define a padding, it does not provide any support for margins.
zh_cn: 尽管 view 可以定义 padding，但它不提供 margin 的支持。

source: Event Handling and Threading
zh_cn: 事件处理和线程

source: Event processing
zh_cn: 事件处理

source: Events will be received in the following order:
zh_cn: 事件将按以下顺序接收：

source: Every button is styled using the system's default button background, which is often different from one version of the platform to another.
zh_cn: 每个按钮都使用系统的默认按钮背景进行样式化，这通常不同于平台的不同版本。

source: Every class and nontrivial public method you write must contain a Javadoc comment with at least one sentence describing what the class or method does.
zh_cn: 你编写的每个类和重要的公开方法都必须包含 Javadoc 备注，至少用一句话说明类或方法的用途。

source: Every file should have a copyright statement at the top, followed by package and import statements (each block separated by a blank line) and finally the class or interface declaration.
zh_cn: 每个文件都应该在顶部放置版权声明，其后是 package 和 import 语句(各个块之间用空行分隔)，最后是类或接口声明。

source: Every method you write, public or otherwise, would benefit from Javadoc.
zh_cn: 你所编写的每一种方法（无论是公开方法还是其他方法）都将受益于 Javadoc。

source: Every view implements onDraw() differently, but there are some common operations that most views share:
zh_cn: 每个 view 以不同方式实现 onDraw()，但大多数 view 共享一些常见操作：

source: Every view must have at least two constraints: one horizontal and one vertical.
zh_cn: 每一个 view 必须至少有两个约束：一个水平和一个垂直约束。

source: Example
zh_cn: 例子

source: Example XML
zh_cn: 示例 XML

source: Example code:
zh_cn: 示例代码：

source: Example of a Button constrained to a vertical Guideline:
zh_cn: 垂直 Guideline 限制的 Button 例子：

source: Example of requiring a single permission:
zh_cn: 需要一个权限的例子：

source: Example of requiring at least one permission from a set:
zh_cn: 需要一组中至少一个权限的例子：

source: Example of requiring multiple permissions:
zh_cn: 需要多个权限的例子：

source: Example of requiring separate read and write permissions for a content provider:
zh_cn: 需要分别请求内容提供者的读写权限的例子：

source: Example:
zh_cn: 例子：

source: Examples of Compound Controls
zh_cn: 组合控件的例子

source: Examples:
zh_cn: 示例：

source: Excepting color changes, it behaves identically to AppCompatCheckBox.
zh_cn: 除了颜色变化外，它的行为与 AppCompatCheckBox 完全相同。

source: Excepting color changes, it behaves identically to AppCompatRadioButton.
zh_cn: 除了颜色变化外，它的行为与 AppCompatRadioButton 完全相同。

source: Excepting color changes, it behaves identically to SwitchCompat.
zh_cn: 除了颜色变化外，其行为与 SwitchCompat 相同。

source: Exception: If the entire conditional (the condition and the body) fit on one line, you may (but are not obligated to) put it all on one line.
zh_cn: 例外情况：如果整个条件语句(条件和主体)适合放在同一行，那么你可以(但不是必须)将其全部放在一行上。

source: Exceptions
zh_cn: 异常

source: Excess Space Distribution
zh_cn: 多余空间分布

source: Exclusive-or the two paths.
zh_cn: 异或，exclusive-or 两条路径。

source: Existing items in the menu will not be modified or removed.
zh_cn: 菜单中的现有项目不会被修改或移除。

source: Expandable lists are able to show an indicator beside each item to display the item's current state (the states are usually one of expanded group, collapsed group, child, or last child).
zh_cn: 可扩展列表能够在每个项目旁边显示一个指示符，以显示项目的当前状态(状态通常是扩展组，折叠组，子项或最后一个项目之一)。

source: Extend onDraw() and onMeasure()
zh_cn: 重写 onDraw() 和 onMeasure() 方法。

source: Extend an existing View class or subclass with your own class.
zh_cn: 继承一个已存在的 View 类或你自己的类。

source: Extend the scroll animation.
zh_cn: 继承滚动动画。

source: Extended floating action buttons are used for a special type of promoted action.
zh_cn: 扩展浮动操作按钮用于特殊类型的提升操作。

source: Extended floating action buttons may have icon and text, but may also hold just an icon or text.
zh_cn: 扩展浮动操作按钮可以具有图标和文本，但也可以仅包含图标或文本。

source: Extending the View class for a completely custom component.
zh_cn: 继承 View 类以获得一个完全的自定义组件。

source: Extra menu information provided to the View.OnCreateContextMenuListener.onCreateContextMenu(ContextMenu, View, ContextMenuInfo) callback when a context menu is brought up for this AdapterView.
zh_cn: 当为此 AdapterView 启用上下文菜单时，提供给 View.OnCreateContextMenuListener.onCreateContextMenu(ContextMenu, View, ContextMenuInfo) 回调的额外菜单信息。

source: Extra menu information specific to an ExpandableListView provided to the View.OnCreateContextMenuListener.onCreateContextMenu(ContextMenu, View, ContextMenuInfo) callback when a context menu is brought up for this AdapterView.
zh_cn: 提供给 View.OnCreateContextMenuListener.onCreateContextMenu(ContextMenu, View, ContextMenuInfo) 的 ExpandableListView 特有的额外菜单信息为此 AdapterView 启用上下文菜单时的回调。

source: Extra offset for the handle at the bottom of the SlidingDrawer.
zh_cn: SlidingDrawer 底部手柄的额外偏移量。

source: Extra offset for the handle at the top of the SlidingDrawer.
zh_cn: SlidingDrawer 顶部手柄的额外偏移量。

source: Fail-fast operations throw ConcurrentModificationException on a best-effort basis.
zh_cn: 快速失败操作会尽最大努力抛出 ConcurrentModificationException 。

source: Failure to do so will trigger an IllegalStateException, thrown by measure(int, int).
zh_cn: 如果不这么做，将会触发一个 IllegalStateException 异溃，由 measure(int, int) 抛出。

source: Failure to do so would not produce well-formed XML.
zh_cn: 如果不这样做，将无法生成格式良好的 XML。

source: Failure to do this will result in an exception being thrown.
zh_cn: 如果不这样做将导致抛出一个异常。

source: Fields
zh_cn: 字段

source: Fig. 1 - Relative Positioning Example
zh_cn: 图。 1 - 相对定位示例

source: Fig. 2 - Relative Positioning Constraints
zh_cn: 图。 2 - 相对定位约束

source: Fig. 3 - Relative Positioning Margins
zh_cn: 图。 3 - 相对定位的外边距

source: Fig. 4 - Centering Positioning
zh_cn: 图 4 - 居中定位

source: Fig. 5 - Centering Positioning with Bias
zh_cn: 图 5 - 带偏心中心定位

source: Figure 1 shows how the system and app processes hand off work between each other.
zh_cn: 图 1 显示了系统和应用程序如何处理彼此之间的工作。

source: Figure 2 shows how to disable filters, and, in the second line of output from the bottom, an example of logcat output of the Displayed time.
zh_cn: 图 2 显示了如何禁用过滤器，在底部的第二行输出中，显示了 Displayed 时间的 logcat 输出示例。

source: Figure 2 shows the original JPG image on the left and the lossy encoded WebP image on the right.
zh_cn: 图 2 显示了左侧的原始 JPG 图像和右侧的有损编码 WebP 图像。

source: Figure 3 shows the same image encoded with the quality set to 0%.
zh_cn: 图 3 显示了质量设置为 0％的相同图像。

source: FileProvider is a special subclass of ContentProvider that facilitates secure sharing of files associated with an app by creating a content:// Uri for a file instead of a file:/// Uri.
zh_cn: FileProvider 是一个特殊 ContentProvider 子类，它为一个文件创建 content:// Uri 代替了 file:/// Uri ，从而有助于安全地与另一个 app 共享文件。

source: Fills the bitmap's pixels with the specified Color.
zh_cn: 使用指定的 Color 填充位图的像素。

source: Finalizers are a way to have a chunk of code executed when an object is garbage collected.
zh_cn: 终结器可以在对象被垃圾回收器回收时执行一段代码。

source: Finally the layout manager can be used in an XML layout like so:
zh_cn: 最后，布局管理器可以在 XML 布局中使用，如下所示：

source: Finally, send the Intent to another app.
zh_cn: 最后，将 Intent 发送给另一个应用程序。

source: Finally, you can hide a column by calling setColumnCollapsed().
zh_cn: 最后，你可以通过调用 setColumnCollapsed() 来隐藏列。

source: Find a child that can receive the event.
zh_cn: 找到可以接收事件的子项。

source: Find by position from scrap/hidden list/cache
zh_cn: 根据位置从 scrap/hidden list/cache 中查找

source: Find find views that contain the specified content description.
zh_cn: 查找包含指定内容描述的查找 view。

source: Find from scrap/cache via stable ids, if exists
zh_cn: 通过稳定 id 从 scrap/cache 中查找，如果存在

source: Find the topmost view under the given point.
zh_cn: 找出给定点下方最顶部的 view。

source: Find views that render the specified text.
zh_cn: 查找呈现指定文本的 view。

source: Finds the view which represents the given adapter position.
zh_cn: 找出展示给定的 adapter position 的 view。

source: Flag for setSystemUiVisibility(int): Requests the navigation bar to draw in a mode that is compatible with light navigation bar backgrounds.
zh_cn: 用于 setSystemUiVisibility(int) 的标志：请求导航栏以与光导航栏背景兼容的模式进行绘制。

source: Flag for setSystemUiVisibility(int): Requests the status bar to draw in a mode that is compatible with light status bar backgrounds.
zh_cn: 用于 setSystemUiVisibility(int) 的标志：请求状态栏以与亮色状态栏背景兼容的模式进行绘制。

source: Flag for setSystemUiVisibility(int): View has requested that the system navigation be temporarily hidden.
zh_cn: 用于 setSystemUiVisibility(int) 的标志：View 已请求暂时隐藏系统导航。

source: Flag for setSystemUiVisibility(int): View has requested the system UI to enter an unobtrusive "low profile" mode.
zh_cn: 用于 setSystemUiVisibility(int) 的标志：View 已请求系统 UI 进入不显眼的“低调”模式。

source: Flag for setSystemUiVisibility(int): View has requested to go into the normal fullscreen mode so that its content can take over the screen while still allowing the user to interact with the application.
zh_cn: 用于 setSystemUiVisibility(int) 的标志：View 已请求进入正常的全屏模式，以便其内容可以接管屏幕，同时仍允许用户与应用程序进行交互。

source: Flag for setSystemUiVisibility(int): View would like its window to be laid out as if it has requested SYSTEM_UI_FLAG_FULLSCREEN, even if it currently hasn't.
zh_cn: 用于 setSystemUiVisibility(int) 的标志：view 要将其窗口布局，就好像它已请求 SYSTEM_UI_FLAG_FULLSCREEN ，即使它目前还没有。

source: Flag for setSystemUiVisibility(int): View would like its window to be laid out as if it has requested SYSTEM_UI_FLAG_HIDE_NAVIGATION, even if it currently hasn't.
zh_cn: 用于 setSystemUiVisibility(int) 的标志：view 会将其窗口布局为就好像它已请求 SYSTEM_UI_FLAG_HIDE_NAVIGATION 一样，即使它目前还没有。

source: Flag for setSystemUiVisibility(int): View would like to remain interactive when hiding the navigation bar with SYSTEM_UI_FLAG_HIDE_NAVIGATION.
zh_cn: 用于 setSystemUiVisibility(int) 的标志：使用 SYSTEM_UI_FLAG_HIDE_NAVIGATION 隐藏导航栏时，view 希望保持交互状态。

source: Flag for setSystemUiVisibility(int): View would like to remain interactive when hiding the status bar with SYSTEM_UI_FLAG_FULLSCREEN and/or hiding the navigation bar with SYSTEM_UI_FLAG_HIDE_NAVIGATION.
zh_cn: 用于 setSystemUiVisibility(int) 的标志：使用 SYSTEM_UI_FLAG_FULLSCREEN 隐藏状态栏时，view 希望保持交互状态和/或使用 SYSTEM_UI_FLAG_HIDE_NAVIGATION 隐藏导航栏。
